{
  "project": "MoneyManager",
  "branchName": "ralph/prd-agent-for-garlic",
  "description": "Create prd-agent.md — a Garlic agent prompt that reads MoneyManager codebase and generates Ralph-ready prd.json",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create prd-agent.md for Garlic",
      "description": "As a developer, I want a Garlic agent prompt that understands the MoneyManager codebase and creates a properly structured prd.json for Ralph, so I can assign tasks to Ralph via Telegram.",
      "acceptanceCriteria": [
        "Создать файл scripts/ralph/prd-agent.md",
        "Промпт описывает агенту как исследовать кодбазу MoneyManager перед созданием stories (модульная структура, слои, паттерны)",
        "Промпт включает точный формат prd.json с примером",
        "Промпт содержит правила декомпозиции stories (размер одной итерации, порядок по зависимостям)",
        "Промпт содержит правила acceptance criteria для Android: './gradlew assembleDebug passes' вместо 'verify in browser'",
        "Промпт указывает куда сохранять файл: scripts/ralph/prd.json",
        "Промпт объясняет как архивировать предыдущий prd.json если branchName изменился",
        "./gradlew assembleDebug passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "This is a markdown prompt file only — no Kotlin/Gradle changes needed. Save to scripts/ralph/prd-agent.md. Context about Garlic: Garlic is an autonomous Telegram bot built on the OpenClaw framework, running on a Google Cloud VM. It supports custom agents defined as markdown prompt files (similar to how Ralph uses CLAUDE.md). Garlic uses Gemini 3.1 Pro as its main model and Gemini 3 Flash for lightweight researcher agents. Garlic has direct access to the MoneyManager git repository on the VM. When a user sends a task via Telegram, Garlic invokes the prd-agent with the task description, the agent explores the codebase and writes scripts/ralph/prd.json, then Garlic triggers ralph.sh. The prompt must be self-contained and written as instructions TO the prd-agent (not about it)."
    },
    {
      "id": "US-002",
      "title": "Update scripts/ralph/CLAUDE.md with prd-agent workflow note",
      "description": "As a developer, I want Ralph's CLAUDE.md to mention that prd.json can be generated by Garlic's prd-agent, so future Ralph iterations understand the context.",
      "acceptanceCriteria": [
        "Добавить секцию '## PRD Generation' в scripts/ralph/CLAUDE.md",
        "Секция объясняет что prd.json может быть создан либо вручную, либо через Garlic prd-agent",
        "Упомянуть что prd-agent.md находится в scripts/ralph/prd-agent.md",
        "./gradlew assembleDebug passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Small addition to existing CLAUDE.md file at scripts/ralph/CLAUDE.md"
    }
  ]
}
